{"deep": 108, "learning": 215, "with": 464, "python": 335, "hands": 171, "on": 277, "introduction": 198, "to": 442, "using": 458, "keras": 208, "and": 18, "tensorflow": 421, "neural": 261, "networks": 259, "ai": 6, "deep learning": 109, "learning with": 223, "with python": 467, "python hands": 337, "hands on": 172, "on introduction": 280, "introduction to": 200, "to deep": 445, "learning using": 222, "using keras": 459, "keras and": 209, "and tensorflow": 32, "tensorflow deep": 423, "learning neural": 217, "neural networks": 262, "networks keras": 260, "keras tensorflow": 210, "tensorflow ai": 422, "clean": 59, "code": 62, "handbook": 169, "of": 267, "agile": 4, "software": 394, "craftsmanship": 91, "principles": 314, "best": 47, "practices": 303, "for": 148, "writing": 471, "maintainable": 228, "refactoring": 349, "clean code": 60, "code handbook": 64, "handbook of": 170, "of agile": 268, "agile software": 5, "software craftsmanship": 395, "craftsmanship principles": 92, "principles and": 315, "and best": 21, "best practices": 48, "practices for": 308, "for writing": 153, "writing clean": 472, "clean maintainable": 61, "maintainable code": 229, "code clean": 63, "code refactoring": 66, "refactoring best": 350, "practices agile": 304, "designing": 115, "data": 94, "intensive": 196, "applications": 33, "patterns": 290, "systems": 413, "scalability": 376, "consistency": 80, "reliability": 357, "database": 100, "distributed": 124, "designing data": 116, "data intensive": 95, "intensive applications": 197, "applications patterns": 34, "patterns for": 291, "for data": 149, "data systems": 99, "systems scalability": 419, "scalability consistency": 377, "consistency reliability": 81, "reliability data": 358, "systems database": 417, "database distributed": 101, "distributed scalability": 125, "algorithms": 7, "comprehensive": 68, "textbook": 427, "covering": 88, "broad": 49, "range": 340, "structures": 407, "complexity": 67, "to algorithms": 443, "algorithms comprehensive": 11, "comprehensive textbook": 70, "textbook covering": 428, "covering broad": 89, "broad range": 50, "range of": 341, "of algorithms": 269, "algorithms algorithms": 8, "algorithms data": 12, "data structures": 98, "structures complexity": 408, "the": 434, "pragmatic": 311, "programmer": 329, "your": 474, "journey": 206, "mastery": 232, "modern": 251, "edition": 131, "classic": 56, "guidance": 164, "development": 118, "productivity": 327, "tips": 440, "the pragmatic": 436, "pragmatic programmer": 312, "programmer your": 330, "your journey": 475, "journey to": 207, "to mastery": 448, "mastery modern": 233, "modern edition": 252, "edition of": 132, "of classic": 270, "classic guidance": 57, "guidance for": 165, "for pragmatic": 150, "pragmatic software": 313, "software development": 396, "development practices": 119, "practices craftsmanship": 306, "craftsmanship productivity": 93, "productivity tips": 328, "cookbook": 82, "recipes": 344, "programmers": 331, "wide": 462, "topics": 449, "python cookbook": 336, "cookbook recipes": 83, "recipes for": 345, "for python": 151, "python programmers": 338, "programmers covering": 332, "covering wide": 90, "wide range": 463, "of topics": 276, "topics python": 450, "python recipes": 339, "recipes tips": 346, "tips patterns": 441, "natural": 257, "language": 211, "processing": 323, "transformers": 455, "practical": 296, "guide": 167, "building": 51, "nlp": 263, "transformer": 453, "models": 249, "huggingface": 177, "bert": 45, "gpt": 163, "natural language": 258, "language processing": 212, "processing with": 324, "with transformers": 470, "transformers practical": 457, "practical guide": 298, "guide to": 168, "to building": 444, "building nlp": 53, "nlp systems": 264, "systems with": 420, "with transformer": 469, "transformer models": 454, "models nlp": 250, "nlp transformers": 265, "transformers huggingface": 456, "huggingface bert": 178, "bert gpt": 46, "machine": 226, "scikit": 385, "learn": 213, "end": 135, "ml": 246, "examples": 146, "libraries": 224, "on machine": 281, "machine learning": 227, "with scikit": 468, "scikit learn": 386, "learn keras": 214, "tensorflow end": 424, "end to": 137, "to end": 446, "end ml": 136, "ml with": 248, "with practical": 466, "practical examples": 297, "examples and": 147, "and modern": 27, "modern libraries": 253, "libraries machine": 225, "learning scikit": 221, "system": 411, "concepts": 73, "foundational": 154, "architectures": 37, "sql": 397, "transactions": 451, "indexing": 189, "concurrency": 78, "database system": 103, "system concepts": 412, "concepts foundational": 76, "foundational principles": 156, "principles of": 316, "of database": 272, "database systems": 104, "systems and": 414, "and architectures": 20, "architectures sql": 38, "sql transactions": 398, "transactions indexing": 452, "indexing concurrency": 191, "site": 392, "engineering": 138, "how": 175, "google": 161, "runs": 373, "production": 325, "sre": 399, "reliable": 361, "scalable": 378, "services": 390, "devops": 120, "monitoring": 255, "incident": 185, "response": 365, "site reliability": 393, "reliability engineering": 359, "engineering how": 139, "how google": 176, "google runs": 162, "runs production": 374, "production systems": 326, "systems principles": 418, "and practices": 30, "practices of": 309, "of sre": 275, "sre for": 401, "for reliable": 152, "reliable scalable": 362, "scalable services": 379, "services sre": 391, "sre devops": 400, "devops reliability": 122, "reliability monitoring": 360, "monitoring incident": 256, "incident response": 186, "microservices": 242, "evolving": 144, "operating": 284, "architecture": 35, "building microservices": 52, "microservices guidance": 244, "guidance on": 166, "on designing": 278, "designing evolving": 117, "evolving and": 145, "and operating": 28, "operating microservices": 285, "microservices microservices": 245, "microservices architecture": 243, "architecture distributed": 36, "distributed systems": 126, "accelerate": 0, "science": 380, "research": 363, "backed": 41, "metrics": 239, "that": 432, "drive": 129, "high": 173, "performance": 292, "dora": 127, "delivery": 110, "accelerate the": 1, "the science": 437, "science of": 381, "of devops": 273, "devops research": 123, "research backed": 364, "backed metrics": 42, "metrics and": 240, "practices that": 310, "that drive": 433, "drive high": 130, "high performance": 174, "performance dora": 293, "dora metrics": 128, "metrics devops": 241, "devops delivery": 121, "delivery performance": 111, "art": 39, "computer": 71, "programming": 333, "vol": 460, "text": 425, "fundamental": 157, "analysis": 15, "the art": 435, "art of": 40, "of computer": 271, "computer programming": 72, "programming vol": 334, "vol classic": 461, "classic text": 58, "text on": 426, "on fundamental": 279, "fundamental algorithms": 158, "algorithms and": 10, "and analysis": 19, "analysis algorithms": 16, "algorithms analysis": 9, "analysis fundamental": 17, "reinforcement": 353, "an": 13, "methods": 236, "in": 183, "rl": 369, "agents": 2, "markov": 230, "decision": 106, "process": 321, "reinforcement learning": 354, "learning an": 216, "an introduction": 14, "introduction foundational": 199, "foundational concepts": 155, "concepts and": 74, "and methods": 25, "methods in": 238, "in reinforcement": 184, "learning reinforcement": 219, "learning rl": 220, "rl agents": 370, "agents markov": 3, "markov decision": 231, "decision process": 107, "pattern": 288, "recognition": 347, "probabilistic": 317, "perspective": 294, "bayesian": 43, "probability": 319, "pattern recognition": 289, "recognition and": 348, "and machine": 24, "learning probabilistic": 218, "probabilistic perspective": 318, "perspective on": 295, "on pattern": 282, "and ml": 26, "ml bayesian": 247, "bayesian probability": 44, "probability pattern": 320, "information": 194, "retrieval": 366, "search": 387, "engines": 140, "ir": 201, "including": 187, "ranking": 342, "tf": 430, "idf": 179, "to information": 447, "information retrieval": 195, "retrieval textbook": 367, "textbook on": 429, "on search": 283, "search engines": 388, "engines and": 141, "and ir": 23, "ir including": 202, "including indexing": 188, "indexing and": 190, "and ranking": 31, "ranking information": 343, "retrieval tf": 368, "tf idf": 431, "idf search": 180, "search ranking": 389, "statistics": 404, "scientists": 383, "essential": 142, "statistical": 402, "practice": 300, "inference": 192, "regression": 351, "sampling": 375, "practical statistics": 299, "statistics for": 405, "data scientists": 97, "scientists essential": 384, "essential statistical": 143, "statistical methods": 403, "methods for": 237, "data science": 96, "science practice": 382, "practice statistics": 302, "statistics inference": 406, "inference regression": 193, "regression sampling": 352, "effective": 133, "java": 203, "idioms": 181, "robust": 371, "design": 112, "effective java": 134, "java best": 204, "practices and": 305, "and idioms": 22, "idioms for": 182, "writing robust": 473, "robust java": 372, "java code": 205, "code java": 65, "practices design": 307, "design patterns": 114, "fundamentals": 159, "coverage": 86, "theory": 438, "relational": 355, "normalization": 266, "fundamentals of": 160, "systems comprehensive": 415, "comprehensive coverage": 69, "coverage of": 87, "database theory": 105, "theory and": 439, "and practice": 29, "practice database": 301, "database relational": 102, "relational design": 356, "design normalization": 113, "core": 84, "case": 54, "studies": 409, "memory": 234, "processes": 322, "operating system": 286, "concepts core": 75, "core concepts": 85, "concepts of": 77, "of modern": 274, "modern operating": 254, "operating systems": 287, "with case": 465, "case studies": 55, "studies operating": 410, "systems concurrency": 416, "concurrency memory": 79, "memory processes": 235}